const data = [
    {
        id: "1",
        name: "政府机构",
        children: [
            {
                id: "101",

                name: "国防",
            },

            {
                id: "102",

                name: "公安",
            },

            {
                id: "103",

                name: "检法司",
            },

            {
                id: "104",

                name: "政法委",
            },

            {
                id: "105",

                name: "纪委",
            },

            {
                id: "106",

                name: "宣传",
            },

            {
                id: "107",

                name: "组织",
            },

            {
                id: "108",

                name: "地方政务",
            },

            {
                id: "109",

                name: "海关",
            },

            {
                id: "110",

                name: "外交",
            },

            {
                id: "111",

                name: "发展和改革",
            },

            {
                id: "112",

                name: "科学技术",
            },

            {
                id: "113",

                name: "民族事务",
            },

            {
                id: "114",

                name: "人力资源和社会保障",
            },

            {
                id: "115",

                name: "财政",
            },

            {
                id: "116",

                name: "税务",
            },

            {
                id: "117",

                name: "民政",
            },

            {
                id: "118",

                name: "市政",
            },

            {
                id: "119",

                name: "自然资源",
            },

            {
                id: "120",

                name: "生态环境",
            },

            {
                id: "121",

                name: "气象",
            },

            {
                id: "122",

                name: "教育",
            },

            {
                id: "123",

                name: "医疗",
            },

            {
                id: "124",

                name: "金融",
            },

            {
                id: "125",

                name: "能源",
            },

            {
                id: "126",

                name: "水利水电",
            },

            {
                id: "127",

                name: "交通运输",
            },

            {
                id: "128",

                name: "工业和信息化",
            },

            {
                id: "129",

                name: "农业农村",
            },

            {
                id: "130",

                name: "文化和旅游",
            },

            {
                id: "131",

                name: "住房和城乡建设",
            },

            {
                id: "132",

                name: "市场监督",
            },

            {
                id: "133",

                name: "应急管理",
            },
        ],
    },
    {
        id: "2",
        name: "教育单位",
        children: [
            {
                id: "201",

                name: "大学",
            },

            {
                id: "202",

                name: "中学",
            },

            {
                id: "203",

                name: "小学",
            },

            {
                id: "204",

                name: "幼儿园",
            },

            {
                id: "205",

                name: "培训",
            },
            {
                id: "206",

                name: "学校",
            },
        ],
    },
    {
        id: "3",
        name: "医疗单位",
        children: [
            {
                id: "301",

                name: "血站",
            },

            {
                id: "302",

                name: "急救中心",
            },

            {
                id: "303",

                name: "疾控中心",
            },

            {
                id: "304",

                name: "卫生院",
            },

            {
                id: "305",

                name: "疗养院",
            },

            {
                id: "306",

                name: "专科医院",
            },

            {
                id: "307",

                name: "中医院",
            },

            {
                id: "308",

                name: "综合医院",
            },
        ],
    },
    {
        id: "4",
        name: "金融企业",
        children: [
            {
                id: "401",

                name: "银行",
            },

            {
                id: "402",

                name: "证券",
            },

            {
                id: "403",

                name: "保险",
            },

            {
                id: "404",

                name: "信托",
            },

            {
                id: "405",

                name: "合作社",
            },

            {
                id: "406",

                name: "平台公司",
            },
        ],
    },
    {
        id: "5",
        name: "商业公司",
        children: [
            {
                id: "501",

                name: "采矿",
            },

            {
                id: "502",

                name: "电力",
            },

            {
                id: "503",

                name: "电气",
            },

            {
                id: "504",

                name: "燃气热力",
            },

            {
                id: "505",

                name: "石油化工",
            },

            {
                id: "506",

                name: "水利",
            },

            {
                id: "507",

                name: "管网",
            },

            {
                id: "508",

                name: "新能源",
            },

            {
                id: "509",

                name: "物流仓储",
            },

            {
                id: "510",

                name: "机场港口",
            },

            {
                id: "511",

                name: "轨道交通",
            },

            {
                id: "512",

                name: "城市交通",
            },

            {
                id: "513",

                name: "制造",
            },

            {
                id: "514",

                name: "零售批发",
            },

            {
                id: "515",

                name: "智慧科技",
            },

            {
                id: "516",

                name: "烟草",
            },

            {
                id: "517",

                name: "汽车",
            },

            {
                id: "518",

                name: "消防安防",
            },

            {
                id: "519",

                name: "通信",
            },

            {
                id: "520",

                name: "互联网",
            },

            {
                id: "521",

                name: "运营商",
            },

            {
                id: "522",

                name: "系统集成",
            },

            {
                id: "523",

                name: "环保",
            },

            {
                id: "524",

                name: "农业",
            },

            {
                id: "525",

                name: "林业",
            },

            {
                id: "526",

                name: "渔业",
            },

            {
                id: "527",

                name: "畜牧",
            },

            {
                id: "528",

                name: "体育",
            },

            {
                id: "529",

                name: "文化",
            },

            {
                id: "530",

                name: "旅游",
            },

            {
                id: "531",

                name: "广电",
            },

            {
                id: "532",

                name: "传媒",
            },

            {
                id: "533",

                name: "教育服务",
            },

            {
                id: "534",

                name: "医疗服务",
            },

            {
                id: "535",

                name: "工程建筑",
            },

            {
                id: "536",

                name: "装饰装修",
            },

            {
                id: "537",

                name: "生活服务",
            },

            {
                id: "538",

                name: "房地产",
            },

            {
                id: "539",

                name: "其他",
            },
        ],
    },
];

export function getPartyTypeJSON() {
    return JSON.parse(JSON.stringify(data));
}
